{
    "en-GB": {
        "MENU_1": "My CV",
        "MENU_3": "Contact",
        "HELLO": "Hello!",
        "PRES_1": "I graduated from Rubika Valenciennes and currently work as a gameplay programmer on Dead Cells at Evil Empire in Bordeaux.",
        "PRES_2": "My expertise lies in designing networked games, but I am particularly drawn to gameplay, and it's on Dead Cells that I've been able to put my skills in this area into practice.",
        "PRES_3": "I enjoy giving impact to every sword swing, iterating on ideas, and especially making sure that each game is more fun than the previous one. You can find examples of my work and achievements on this portfolio, as well as information about my professional background.",
        "PRES_4": "Enjoy browsing my portfolio!",
        "HAXE": "Haxe",
        "HAXE_HEAPS": "Heaps.io",
        "UNITY_CS": "C# oriented Unity",
        "UNITY_GPP": "Gameplay, Tools, Shaders, and FX",
        "UNITY_SHADER": "Shader Graph and HLSL",
        "UNITY_ONLINE_SERV": "Peer-to-peer and server-oriented",
        "UNITY_ONLINE_DRKR": "Darkift",
        "UNITY_ONLINE_PUN": "PUN Photon Engine ",
        "UNITY_ONLINE_FORGE": "Forge Networking",
        "CS_WPF": "WPF",
        "CS_ASP": "ASP.NET",
        "CS_SQL": "SQL Server",
        "CS_CSIDE": "C/Side and NAV",
        "MC_PURPLE_TITLE": "Castlevania DLC",
        "MC_PURPLE_PRES_1": "I had the chance to work on the Castlevania DLC and contribute freely to different aspects of its design and gameplay.",
        "MC_PURPLE_PRES_2": "My main role was to develop the final two bosses, Dracula and his final form, as well as several weapons and powers such as the snake sword, bouncing stone, bat swarm, death scythe...",
        "MC_PURPLE_PRES_3": "Working on this project related to the Castlevania universe was an incredibly enriching experience for me.",
        "MC_PURPLE_PRES_4": "Not only was I able to put my programming skills into practice, but I also had the opportunity to work on game design and bring to life iconic characters and elements of this game.",
        "MC_BANK_TITLE": "The Bank",
        "MC_BANK_PRES_1": "This was my first major update for Dead Cells that I worked on in collaboration with an artist.",
        "MC_BANK_PRES_2": "My role was to design and develop the new biome: from its random generation to the integration of graphic elements, level design, and the implementation of all the features that contributed to its realization",
        "MC_BANK_PRES_3": "In addition, I was responsible for programming the new enemies, mutations, and weapons.",
        "MC_BANK_PRES_4": "This project was an opportunity for me to work closely with an artist to create a captivating and immersive biome.",
        "MC_QATS_TITLE": "DLC Queen and the Sea",
        "MC_QATS_PRES_1": "One of my first tasks was to contribute to the creation of the Queen and the Sea DLC, specifically designing the second biome called \"The Lighthouse\".",
        "MC_QATS_PRES_2": "In this level, players must fight against three bosses at once while climbing a burning lighthouse. I had to develop the three bosses capable of fighting both alone and together, making sure they would be both fun to fight and challenging for players.",
        "MC_QATS_PRES_3": "I also had to create the procedural generation and level design of the level.",
        "MC_END_TITLE": "And more !",
        "MC_END_PRES_1": "A lot of update and content ! click here to see more "
    },
    "fr-FR": {
        "MENU_1": "Mon CV",
        "MENU_2": "Mes Projets",
        "MENU_3": "Contact",
        "HELLO": "Bonjour !",
        "PRES_1": "Je suis diplômé de Rubika Valenciennes et actuellement programmeur gameplay sur Dead Cells sur Bordeaux à Evil Empire.",
        "PRES_2": "Mon expertise se situe dans la conception de jeux en réseau, mais je suis particulièrement attiré par le gameplay et c'est sur Dead Cells que j'ai pu mettre en pratique mes compétences dans ce domaine.",
        "PRES_3": "J'aime donner de l'impact à chaque coup d'épée, itérer sur des idées et surtout m'assurer que chaque partie est plus amusante que la précédente. Vous pourrez trouver sur ce portfolio des exemples de mon travail et de mes réalisations, ainsi que des informations sur mon parcours professionnel.",
        "PRES_4": "Bonne visite de mon portfolio !",
        "HAXE": "Haxe",
        "HAXE_HEAPS": "Heaps.io",
        "UNITY_CS": "C# orienté Unity",
        "UNITY_GPP": "Gameplay, Tools, Shaders et FX",
        "UNITY_SHADER": "Shader Graph et HLSL",
        "UNITY_ONLINE_SERV": "Pair à pair et orienté serveur",
        "UNITY_ONLINE_DRKR": "Darkift",
        "UNITY_ONLINE_PUN": "PUN Photon Engine ",
        "UNITY_ONLINE_FORGE": "Forge Networking",
        "CS_WPF": "WPF",
        "CS_ASP": "ASP.NET",
        "CS_SQL": "SQL Server",
        "CS_CSIDE": "C/Side et NAV",
        "MC_PURPLE_TITLE": " DLC Castlevania",
        "MC_PURPLE_PRES_1": "J'ai eu la chance de travailler sur le DLC Castlevania et de participer librement à différents aspects de sa conception et de son design.",
        "MC_PURPLE_PRES_2": "Mon rôle principal était de développer les deux derniers boss, à savoir Dracula et sa forme finale, ainsi que plusieurs armes et pouvoirs tels que l'épée serpent, la pierre rebondissante, la volée de chauve-souris, la faux de Mort...",
        "MC_PURPLE_PRES_3": "Travailler sur ce projet lié à l'univers de Castlevania a été une expérience incroyablement enrichissante pour moi.",
        "MC_PURPLE_PRES_4": "Non seulement j'ai pu mettre en pratique mes compétences en programmation, mais j'ai également eu l'opportunité de travailler sur le game design et de donner vie à des personnages et des éléments emblématiques de ce jeu.",
        "MC_BANK_TITLE": "La banque",
        "MC_BANK_PRES_1": "Il s'agit de ma première mise à jour majeure pour Dead Cells que j'ai réalisé collaboration avec un artiste.",
        "MC_BANK_PRES_2": "Mon rôle était de concevoir et développer le nouveau biome : de sa génération aléatoire, à l'intégration des éléments graphiques, le level design et de l'implémentation de toutes les fonctionnalités qui ont contribué à la réalisation de celui-ci",
        "MC_BANK_PRES_3": "De plus, j'ai été responsable de la programmation des nouveaux ennemis, mutations et armes.",
        "MC_BANK_PRES_4": "Ce projet a été une occasion pour moi de travailler en étroite collaboration avec un artiste afin de créer un biome captivant et immersif.",
        "MC_QATS_TITLE": "DLC Queen and the sea",
        "MC_QATS_PRES_1": "L'une de mes premières tâches a été de contribuer à la création du DLC Queen and the Sea, en particulier la conception du deuxième biome appelé \"Le Phare\".",
        "MC_QATS_PRES_2": "Dans ce niveau, les joueurs doivent affronter trois boss en même temps tout en escaladant un phare en feu. Jai dû développer les trois boss capable de combattre à la fois seul mais aussi en cohésion en m'assurant qu'ils seraient à la fois amusants à combattre mais surtout challengant pour les joueurs.",
        "MC_QATS_PRES_3": "J'ai du aussi réaliser l'affichage procédural et le level design du niveau",
        "MC_END_TITLE": "Et plus encore !",
        "MC_END_PRES_1": "Je n'allais pas tout mettre ici ! Cliquez ici pour en voir plus sur mon travail pour Dead Cells !"
    }
}